Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.4.149/include/component/fuses.h
/* -------- FUSES_USER_WORD_5 : (FUSES Offset: 0x14) (R/W 32) USER Page Word 5 -------- */
#define FUSES_USER_WORD_5_RESETVALUE          _UINT32_(0x00)                                       /*  (FUSES_USER_WORD_5) USER Page Word 5  Reset Value */

#define FUSES_USER_WORD_5_NONSECB_IDAU_Pos    _UINT32_(0)                                          /* (FUSES_USER_WORD_5) IDAU Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_IDAU_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_5_NONSECB_IDAU_Pos) /* (FUSES_USER_WORD_5) IDAU Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_IDAU(value) (FUSES_USER_WORD_5_NONSECB_IDAU_Msk & (_UINT32_(value) << FUSES_USER_WORD_5_NONSECB_IDAU_Pos)) /* Assigment of value for NONSECB_IDAU in the FUSES_USER_WORD_5 register */
#define FUSES_USER_WORD_5_NONSECB_DSU_Pos     _UINT32_(1)                                          /* (FUSES_USER_WORD_5) DSU Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_DSU_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_5_NONSECB_DSU_Pos) /* (FUSES_USER_WORD_5) DSU Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_DSU(value)  (FUSES_USER_WORD_5_NONSECB_DSU_Msk & (_UINT32_(value) << FUSES_USER_WORD_5_NONSECB_DSU_Pos)) /* Assigment of value for NONSECB_DSU in the FUSES_USER_WORD_5 register */
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos _UINT32_(2)                                          /* (FUSES_USER_WORD_5) NVMCTRL Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL_Msk (_UINT32_(0x1) << FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos) /* (FUSES_USER_WORD_5) NVMCTRL Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL(value) (FUSES_USER_WORD_5_NONSECB_NVMCTRL_Msk & (_UINT32_(value) << FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos)) /* Assigment of value for NONSECB_NVMCTRL in the FUSES_USER_WORD_5 register */
#define FUSES_USER_WORD_5_NONSECB_DMAC_Pos    _UINT32_(3)                                          /* (FUSES_USER_WORD_5) DMAC Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_DMAC_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_5_NONSECB_DMAC_Pos) /* (FUSES_USER_WORD_5) DMAC Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_DMAC(value) (FUSES_USER_WORD_5_NONSECB_DMAC_Msk & (_UINT32_(value) << FUSES_USER_WORD_5_NONSECB_DMAC_Pos)) /* Assigment of value for NONSECB_DMAC in the FUSES_USER_WORD_5 register */
#define FUSES_USER_WORD_5_Msk                 _UINT32_(0x0000000F)                                 /* (FUSES_USER_WORD_5) Register Mask  */


/* -------- FUSES_USER_WORD_6 : (FUSES Offset: 0x18) (R/W 32) USER Page Word 6 -------- */
#define FUSES_USER_WORD_6_RESETVALUE          _UINT32_(0x00)                                       /*  (FUSES_USER_WORD_6) USER Page Word 6  Reset Value */

#define FUSES_USER_WORD_6_NONSECC_EVSYS_Pos   _UINT32_(0)                                          /* (FUSES_USER_WORD_6) EVSYS Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_EVSYS_Msk   (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_EVSYS_Pos) /* (FUSES_USER_WORD_6) EVSYS Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_EVSYS(value) (FUSES_USER_WORD_6_NONSECC_EVSYS_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_EVSYS_Pos)) /* Assigment of value for NONSECC_EVSYS in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos _UINT32_(1)                                          /* (FUSES_USER_WORD_6) SERCOM0 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM0_Msk (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos) /* (FUSES_USER_WORD_6) SERCOM0 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM0(value) (FUSES_USER_WORD_6_NONSECC_SERCOM0_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos)) /* Assigment of value for NONSECC_SERCOM0 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos _UINT32_(2)                                          /* (FUSES_USER_WORD_6) SERCOM1 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM1_Msk (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos) /* (FUSES_USER_WORD_6) SERCOM1 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM1(value) (FUSES_USER_WORD_6_NONSECC_SERCOM1_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos)) /* Assigment of value for NONSECC_SERCOM1 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos _UINT32_(3)                                          /* (FUSES_USER_WORD_6) SERCOM2 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM2_Msk (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos) /* (FUSES_USER_WORD_6) SERCOM2 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM2(value) (FUSES_USER_WORD_6_NONSECC_SERCOM2_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos)) /* Assigment of value for NONSECC_SERCOM2 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_TC0_Pos     _UINT32_(4)                                          /* (FUSES_USER_WORD_6) TC0 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC0_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_TC0_Pos) /* (FUSES_USER_WORD_6) TC0 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC0(value)  (FUSES_USER_WORD_6_NONSECC_TC0_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TC0_Pos)) /* Assigment of value for NONSECC_TC0 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_TC1_Pos     _UINT32_(5)                                          /* (FUSES_USER_WORD_6) TC1 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC1_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_TC1_Pos) /* (FUSES_USER_WORD_6) TC1 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC1(value)  (FUSES_USER_WORD_6_NONSECC_TC1_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TC1_Pos)) /* Assigment of value for NONSECC_TC1 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_TC2_Pos     _UINT32_(6)                                          /* (FUSES_USER_WORD_6) TC2 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC2_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_TC2_Pos) /* (FUSES_USER_WORD_6) TC2 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC2(value)  (FUSES_USER_WORD_6_NONSECC_TC2_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TC2_Pos)) /* Assigment of value for NONSECC_TC2 in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_ADC_Pos     _UINT32_(7)                                          /* (FUSES_USER_WORD_6) ADC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_ADC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_ADC_Pos) /* (FUSES_USER_WORD_6) ADC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_ADC(value)  (FUSES_USER_WORD_6_NONSECC_ADC_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_ADC_Pos)) /* Assigment of value for NONSECC_ADC in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_DAC_Pos     _UINT32_(8)                                          /* (FUSES_USER_WORD_6) DAC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_DAC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_DAC_Pos) /* (FUSES_USER_WORD_6) DAC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_DAC(value)  (FUSES_USER_WORD_6_NONSECC_DAC_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_DAC_Pos)) /* Assigment of value for NONSECC_DAC in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_PTC_Pos     _UINT32_(9)                                          /* (FUSES_USER_WORD_6) PTC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_PTC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_PTC_Pos) /* (FUSES_USER_WORD_6) PTC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_PTC(value)  (FUSES_USER_WORD_6_NONSECC_PTC_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_PTC_Pos)) /* Assigment of value for NONSECC_PTC in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_TRNG_Pos    _UINT32_(10)                                         /* (FUSES_USER_WORD_6) TRNG Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TRNG_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_TRNG_Pos) /* (FUSES_USER_WORD_6) TRNG Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TRNG(value) (FUSES_USER_WORD_6_NONSECC_TRNG_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TRNG_Pos)) /* Assigment of value for NONSECC_TRNG in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_CCL_Pos     _UINT32_(11)                                         /* (FUSES_USER_WORD_6) CCL Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_CCL_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_CCL_Pos) /* (FUSES_USER_WORD_6) CCL Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_CCL(value)  (FUSES_USER_WORD_6_NONSECC_CCL_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_CCL_Pos)) /* Assigment of value for NONSECC_CCL in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_OPAMP_Pos   _UINT32_(12)                                         /* (FUSES_USER_WORD_6) OPAMP Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_OPAMP_Msk   (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_OPAMP_Pos) /* (FUSES_USER_WORD_6) OPAMP Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_OPAMP(value) (FUSES_USER_WORD_6_NONSECC_OPAMP_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_OPAMP_Pos)) /* Assigment of value for NONSECC_OPAMP in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_NONSECC_TRAM_Pos    _UINT32_(13)                                         /* (FUSES_USER_WORD_6) TRAM Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TRAM_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_6_NONSECC_TRAM_Pos) /* (FUSES_USER_WORD_6) TRAM Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TRAM(value) (FUSES_USER_WORD_6_NONSECC_TRAM_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TRAM_Pos)) /* Assigment of value for NONSECC_TRAM in the FUSES_USER_WORD_6 register */
#define FUSES_USER_WORD_6_Msk                 _UINT32_(0x00003FFF)                                 /* (FUSES_USER_WORD_6) Register Mask  */

